Program Sin_wav_Gener;
Var DAC_CLK: word;                             //Частота смены данных DAC.
    Loop:    word;                             //Колличество элементов в волне.
    PR:      real;                             //Период волны.
    I:       word;                             //Счетчик.
    ISIN:    byte;                             //Счетчик номера волны.
    GR:      byte;                             //Громкость волны.
    MesVoln: array [0..100000] of integer;     //Массив значений для волны.
    MesSM:   array [0..131] of word;           //Смещение.
    MesKOL:  array [0..131] of word;           //Колличество в блоке.
    
const SinTON: array [0..131] of real = 
      (16.35,   17.32,  18.35,  19.40,  20.60,  21.83,  23.12,  24.50,  25.96,
       27.50,   29.14,  30.87,  32.70,  34.65,  36.95,  38.88,  41.21,  43.65,
       46.25,   49,     51.90,  55,     58.26,  61.74,  65.41,  69.30,  73.91,
       77.78,   82.41,  87.31,  92.50,  98,     103.80, 110,    116.54, 123.48,
       130.82,  138.59, 147.83, 155.56, 164.81, 174.62, 185,    196,    207,
       220,     233.08, 246.96, 261.63, 277.18, 293.33, 311.13, 329.63, 349.23,
       369.99,  392,    415.30, 440,    466.16, 493.88, 523.25, 554.36, 587.32,
       622.26,  659.26, 698.46, 739.98, 784,    830.60, 880,    932.32, 987.75,
       1046.5,  1108.7, 1174.6, 1244.5, 1318.5, 1396.9, 1480,   1568,   1661.2,
       1760,    1864.6, 1975.5, 2093,   2217.4, 2349.2, 2489,   2637,   2793.8,
       2960,    3136,   3322.4, 3520,   3729.2, 3951,   4186,   4434.8, 4698.4,
       4978,    5274,   5587.6, 5920,   6272,   6644.8, 7040,   7458.4, 7902,
       8372,    8869.6, 9396.8, 9956,   10548,  11175.2,11840,  12544,  13289.6,
       14080,   14916.8,15804,  16744,  17739.2,18793.6,19912,  21096,  22350.4,
       23680,   25088,  26579.2,28160,  29833.6,31608);
 
Begin
  Loop := 0;                                       //Общее колличество занимаемой памяти.
  write('Частота смены DAC: '); readln(DAC_CLK);   //Получаем частоту смены DAC.
  write('Введите громкость (1..50): '); readln(GR);//Громкость волны.
  for ISIN:=0 to 131 do                             //Генерируем массивы для всех 36 нот.
  Begin
    PR:=DAC_CLK/SinTON[ISIN]/2;                    //Получаем период волны.  
    MesSM[ISIN]:=Loop;                             //Смещение.
    MesKOL[ISIN]:=Round(PR*2)+1;                   //Колличество элементов в блоке.
    for I:=0 to Round(PR*2) do                     //Считаем волну.
      Begin
        MesVoln[Loop]:=Round(GR+GR*sin(I*pi/PR));
        Loop:=Loop+1;
      End;
  End;
  
  writeln('//Колличество элементов в синусоиде.');
  write('const uint16_t MesKOL [133] = {');
  for I:=0 to 131 do write(MesKOL[I], ', ');
  writeln('1};');                                   //Последний элемент - пустота. Она занимает 1 блок.
 
  writeln('//Смещение первого элемента массива.');
  write('const uint16_t MesSM [133] = {');
  for I:=0 to 131 do write(MesSM[I], ', ');
  writeln(MesSM[131]+MesKOL[131], '};');            //Положение "пустоты". Для паузы.
  
  writeln('//Выдаем основной массив.');
  write('const uint8_t SinMES [', Loop+1, '] = {');
  for I:=0 to Loop-1 do write(MesVoln[I], ', ');
  writeln(0, '};');                                 //Последний элемент - "0". Пустота. 
End.


